<a href="https://colab.research.google.com/github/Mjcherono/MoringaIPs/blob/master/Data_Investigation_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas

## 1.0 Importing our Libraries

In [21]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd
# Importing the numpy library
#
import numpy as pd


## 1.1 Reading the Dataset from our CSV file



The dataset we will use contains information about the 2009 Census - The Rural Urban Population by Age, Sex and District.


*   Dataset link for download or access: [Link](https://drive.google.com/open?id=1pc9ZLFGsosdWBk1lI29ADIqRtCvD_FBe)

In [22]:
import pandas as pd

In [23]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
df = pd.read_csv('/content/Rural_Urban_Population_By_Age_Sex_and_by_District__2009.csv')
df.head(3)

       District Urban/Rural Age_years   Male  ...  Total   County Province OBJECTID
0  NAIROBI WEST       Urban         0  10126  ...  20242  Nairobi  NAIROBI        0
1  NAIROBI WEST       Urban         1   8124  ...  16113  Nairobi  NAIROBI        1
2  NAIROBI WEST       Urban         2   8462  ...  17089  Nairobi  NAIROBI        2

[3 rows x 9 columns]

## 1.2 Previewing our Dataset

In [24]:
# Let's preview the first 10 rows of our data
# 
df.head(10)

       District Urban/Rural Age_years   Male  ...  Total   County Province OBJECTID
0  NAIROBI WEST       Urban         0  10126  ...  20242  Nairobi  NAIROBI        0
1  NAIROBI WEST       Urban         1   8124  ...  16113  Nairobi  NAIROBI        1
2  NAIROBI WEST       Urban         2   8462  ...  17089  Nairobi  NAIROBI        2
3  NAIROBI WEST       Urban         3   8334  ...  16754  Nairobi  NAIROBI        3
4  NAIROBI WEST       Urban         4   7948  ...  15768  Nairobi  NAIROBI        4
5  NAIROBI WEST       Urban         5   7547  ...  15207  Nairobi  NAIROBI        5
6  NAIROBI WEST       Urban         6   6966  ...  14048  Nairobi  NAIROBI        6
7  NAIROBI WEST       Urban         7   6511  ...  13185  Nairobi  NAIROBI        7
8  NAIROBI WEST       Urban         8   6171  ...  12660  Nairobi  NAIROBI        8
9  NAIROBI WEST       Urban         9   6361  ...  13023  Nairobi  NAIROBI        9

[10 rows x 9 columns]

## 1.3 Accessing Information about our Dataset

In [25]:
df.dtypes

District       object
Urban/Rural    object
Age_years      object
Male            int64
Female          int64
Total           int64
County         object
Province       object
OBJECTID        int64
dtype: object

In [26]:
df.duplicated()
df.drop_duplicates()

           District Urban/Rural Age_years  ...   County  Province  OBJECTID
0      NAIROBI WEST       Urban         0  ...  Nairobi   NAIROBI         0
1      NAIROBI WEST       Urban         1  ...  Nairobi   NAIROBI         1
2      NAIROBI WEST       Urban         2  ...  Nairobi   NAIROBI         2
3      NAIROBI WEST       Urban         3  ...  Nairobi   NAIROBI         3
4      NAIROBI WEST       Urban         4  ...  Nairobi   NAIROBI         4
...             ...         ...       ...  ...      ...       ...       ...
25415    TESO SOUTH       Rural        77  ...    Busia   WESTERN     25415
25416    TESO SOUTH       Rural        78  ...    Busia   WESTERN     25416
25417    TESO SOUTH       Rural        79  ...    Busia   WESTERN     25417
25418    TESO SOUTH       Rural       80+  ...    Busia   WESTERN     25418
25419    TESO SOUTH       Rural    Age NS  ...    Busia   WESTERN     25419

[25420 rows x 9 columns]

In [27]:
df.isnull()

       District  Urban/Rural  Age_years  ...  County  Province  OBJECTID
0         False        False      False  ...   False     False     False
1         False        False      False  ...   False     False     False
2         False        False      False  ...   False     False     False
3         False        False      False  ...   False     False     False
4         False        False      False  ...   False     False     False
...         ...          ...        ...  ...     ...       ...       ...
25415     False        False      False  ...   False     False     False
25416     False        False      False  ...   False     False     False
25417     False        False      False  ...   False     False     False
25418     False        False      False  ...   False     False     False
25419     False        False      False  ...   False     False     False

[25420 rows x 9 columns]

In [28]:
df.dropna()

           District Urban/Rural Age_years  ...   County  Province  OBJECTID
0      NAIROBI WEST       Urban         0  ...  Nairobi   NAIROBI         0
1      NAIROBI WEST       Urban         1  ...  Nairobi   NAIROBI         1
2      NAIROBI WEST       Urban         2  ...  Nairobi   NAIROBI         2
3      NAIROBI WEST       Urban         3  ...  Nairobi   NAIROBI         3
4      NAIROBI WEST       Urban         4  ...  Nairobi   NAIROBI         4
...             ...         ...       ...  ...      ...       ...       ...
25415    TESO SOUTH       Rural        77  ...    Busia   WESTERN     25415
25416    TESO SOUTH       Rural        78  ...    Busia   WESTERN     25416
25417    TESO SOUTH       Rural        79  ...    Busia   WESTERN     25417
25418    TESO SOUTH       Rural       80+  ...    Busia   WESTERN     25418
25419    TESO SOUTH       Rural    Age NS  ...    Busia   WESTERN     25419

[25420 rows x 9 columns]

In [29]:
pop.columns

NameError: ignored

In [30]:
number = pop["Age_years"].unique()

for i in number:
  try:
    y=int(r)
  except ValueError:
      print(r)

NameError: ignored

In [31]:
#changing data type of age to int
#df['Age_years'] = pd.to_numeric(df['Age_years'])
df.Age_years.replace('80+','80',inplace=True)
df.Age_years.replace('Age NS','0',inplace = True)
df.Age_years = df.Age_years.astype(int)
df.dtypes

District       object
Urban/Rural    object
Age_years       int64
Male            int64
Female          int64
Total           int64
County         object
Province       object
OBJECTID        int64
dtype: object

In [96]:
# We can getting to know more about the dataset by accessing its information 
#
df.describe()

          Age_years          Male        Female         Total      OBJECTID
count  25420.000000  25420.000000  25420.000000  25420.000000  25420.000000
mean      39.512195    755.014083    763.872502   1518.886585  12709.500000
std       23.649445   1305.988549   1295.903980   2589.418161   7338.266258
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%       19.000000     57.000000     54.000000    112.000000   6354.750000
50%       39.500000    269.500000    281.000000    555.000000  12709.500000
75%       60.000000    891.000000    950.000000   1849.250000  19064.250000
max       80.000000  23060.000000  23090.000000  44473.000000  25419.000000

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [97]:
df.columns

Index(['District', 'Urban/Rural', 'Age_years', 'Male', 'Female', 'Total',
       'County', 'Province', 'OBJECTID'],
      dtype='object')

In [98]:
# Challenge 1
# What was the average age of a person of Kenya?
#
df['Age_years'].mean()

39.51219512195122

In [99]:
# Challenge 2
# What was the average female population in Kenya?
#
df.Female.mean()

763.8725019669552

In [100]:
# Challenge 3
# What was the average male population in Kenya?
#
df.Male.mean()

755.0140833988985

In [101]:
# Challenge 4
# Which 5 districts were the most densely populated Kenya in descending order?
#df_mostpop = df['District'].groupby(df['Total'])
df_mostpop = df[['District','Total']]
df_mostpop.sort_values(by = 'Total',ascending = 0)
df_mostpop.head(5)

       District  Total
0  NAIROBI WEST  20242
1  NAIROBI WEST  16113
2  NAIROBI WEST  17089
3  NAIROBI WEST  16754
4  NAIROBI WEST  15768

In [102]:
# Challenge 5
# Which 5 counties were the most densely populated Counties in descending order?
# 
mostpop_counties = df[["County", "Total"]]
mostpop_counties.sort_values(by='Total',ascending = 0)
mostpop_counties.head(5)

    County  Total
0  Nairobi  20242
1  Nairobi  16113
2  Nairobi  17089
3  Nairobi  16754
4  Nairobi  15768

In [107]:
# Challenge 6
# Which 5 districts were the most sparsely populated in descending order?
# 
df_mostpop = df[['District','Total']]
df_mostpop.sort_values(by = 'Total',ascending = 1)
df_mostpop

           District  Total
0      NAIROBI WEST  20242
1      NAIROBI WEST  16113
2      NAIROBI WEST  17089
3      NAIROBI WEST  16754
4      NAIROBI WEST  15768
...             ...    ...
25415    TESO SOUTH    185
25416    TESO SOUTH    110
25417    TESO SOUTH    211
25418    TESO SOUTH    775
25419    TESO SOUTH     48

[25420 rows x 2 columns]

In [104]:
# Challenge 7
# What was the average population of the the most densely populated county in Kenya?
# 
mostpop_counties = df[["County", "Total"]]
df.loc[df['County'] == 'Nairobi'].max()

District       WESTLANDS
Urban/Rural        Urban
Age_years             80
Male               23060
Female             23090
Total              44473
County           Nairobi
Province         NAIROBI
OBJECTID             327
dtype: object

In [109]:
# Challenge 8
# What was the average population of the the most sparsely populated county in Kenya?
# 
mostpop_counties = df[["County", "Total"]]
df.loc[df['County'] == 'TESO SOUTH'].max()

District      NaN
Urban/Rural   NaN
Age_years     NaN
Male          NaN
Female        NaN
Total         NaN
County        NaN
Province      NaN
OBJECTID      NaN
dtype: float64

In [111]:
# Challenge 9
# What was the total population of Busia County? 
# 
mostpop_counties = df[["County", "Total"]]
df.loc[df['County'] == 'Busia']

         District Urban/Rural  Age_years  Male  ...  Total  County Province OBJECTID
12546       BUSIA       Urban          0   790  ...   1633   Busia  WESTERN    12546
12547       BUSIA       Urban          1   679  ...   1328   Busia  WESTERN    12547
12548       BUSIA       Urban          2   715  ...   1440   Busia  WESTERN    12548
12549       BUSIA       Urban          3   709  ...   1408   Busia  WESTERN    12549
12550       BUSIA       Urban          4   675  ...   1330   Busia  WESTERN    12550
...           ...         ...        ...   ...  ...    ...     ...      ...      ...
25415  TESO SOUTH       Rural         77    99  ...    185   Busia  WESTERN    25415
25416  TESO SOUTH       Rural         78    63  ...    110   Busia  WESTERN    25416
25417  TESO SOUTH       Rural         79    90  ...    211   Busia  WESTERN    25417
25418  TESO SOUTH       Rural         80   384  ...    775   Busia  WESTERN    25418
25419  TESO SOUTH       Rural          0    25  ...     48   Busia  WESTERN    25419

[820 rows x 9 columns]

In [115]:
# Challenge 10
# What was the average age of person in Busia County? How many people of this age were in Busia County?
# 
busia = df.loc[df['County'] == 'Busia']
busia.Age_years.mean()

39.51219512195122

In [117]:
busia.Age_years.value_counts()

0     20
39    10
21    10
22    10
23    10
      ..
54    10
55    10
56    10
57    10
40    10
Name: Age_years, Length: 81, dtype: int64

In [120]:
# Challenge 11
# What was the Total population of Teso South District?
# 
df.loc[df['District'] == 'Teso South', 'Total'].sum()

0

In [ ]:
# Challenge 12
# What was the urban population of Teso South District?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 13
# What was the rural population of Teso South District?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 14
# What was the population of people aged 60 and above in Kenya?
#
OUR CODE GOES HERE

In [ ]:
# Challenge 15 
# What was the urban population in Kenya?
#
OUR CODE GOES HERE